Repository: TandoorRecipes/recipes
Catalog: cookbook/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Filter recipes updated on or after YYYY-MM-DD. Prepending - filters on or before date.
uk: Рецепти фільтрів оновлено в день YYYY-MM-DD або пізніше. Додавання префікса - фільтрує за датою або раніше.

source: Filter recipes lasts viewed on or after YYYY-MM-DD. Prepending - filters on or before date.
uk: Фільтрувати рецепти, переглянуті в день або після YYYY-MM-DD. Додавання префікса - фільтрує за датою або до дати.

source: Filter recipes that can be made with OnHand food. [true/<b>false</b>]
uk: Фільтрувати рецепти, які можна приготувати з продуктами, що є в наявності. [true/<b>false</b>]

source: Returns the shopping list entry with a primary key of id. Multiple values allowed.
uk: Повертає запис списку покупок з первинним ключем id. Допускається кілька значень.

source: Filter shopping list entries on checked. [true, false, both, <b>recent</b>]<br> - recent includes unchecked items and recently completed items.
uk: Фільтрувати записи у списку покупок за позначкою. [true, false, both, <b>нещодавно</b>]<br> - нещодавно включає непозначені елементи та нещодавно виконані елементи.

source: Returns the shopping list entries sorted by supermarket category order.
uk: Повертає записи списку покупок, відсортовані за категоріями супермаркетів.

source: Filter for entries with the given recipe
uk: Фільтр для записів із заданим рецептом

source: Return the Automations matching the automation type. Multiple values allowed.
uk: Повернути автоматизації, що відповідають типу автоматизації. Допускається кілька значень.

source: Nothing to do.
uk: Нічого робити.

source: Invalid Url
uk: Неправильний URL

source: Connection Refused.
uk: Підключення відхилено.

source: Bad URL Schema.
uk: Погана схема URL.

source: No usable data could be found.
uk: Не вдалося знайти корисних даних.

source: File is above space limit
uk: Файл перевищує обмеження розміру

source: Importing is not implemented for this provider
uk: Імпорт не реалізований для цього постачальника

source: This feature is not yet available in the hosted version of tandoor!
uk: Ця функція ще не доступна в хостинговій версії Tandoor!

source: Sync successful!
uk: Синхронізація успішна!

source: Error synchronizing with Storage
uk: Помилка синхронізації зі сховищем

source: Batch edit done. %(count)d recipe was updated.
uk: Групове редагування завершено. %(count)d рецепт оновлено.

source: Monitor
uk: Моніторінг

source: Storage Backend
uk: Сховище (бекенд)

source: Could not delete this storage backend as it is used in at least one monitor.
uk: Не вдалося видалити це сховище для бекенду, оскільки воно використовується принаймні в одному моніторінгу.

source: Connectors Config Backend
uk: Конфігурація коннекторів для бекенду

source: Invite Link
uk: Посилання для запрошення

source: Space Membership
uk: Участь в просторі

source: You cannot edit this storage!
uk: Ви не можете редагувати це сховище!

source: Storage saved!
uk: Сховище збережено!

source: There was an error updating this storage backend!
uk: Сталася помилка під час оновлення цього сховища!

source: Config saved!
uk: Конфігурація збережена!

source: ConnectorConfig
uk: Конфігурація конектора

source: Changes saved!
uk: Зміни збережені!

source: Error saving changes!
uk: Помилка під час збереження змін!

source: The PDF Exporter is not enabled on this instance as it is still in an experimental state.
uk: PDF експорт не включений на цьому сервері, бо це все ще експериментальна функція.

source: Import Log
uk: Журнал імпорту

source: Discovery
uk: Огляд

source: Shopping List
uk: Список покупок

source: Connector Config Backend
uk: Конфігурація коннектора для бекенду

source: Invite Links
uk: Посилання для запрошеннь

source: Supermarkets
uk: Супермаркети

source: Shopping Categories
uk: Категорії покупок

source: Custom Filters
uk: Спеціальні фільтри

source: Steps
uk: Кроки

source: Property Types
uk: Типи об'єктів

source: This feature is not enabled by the server admin!
uk: Ця функція не включена адміністратором сервера!

source: Imported new recipe!
uk: Імпортовано новий рецепт!

source: There was an error importing this recipe!
uk: Сталася помилка під час імпортування цього рецепту!

source: This feature is not available in the demo version!
uk: Ця функція не доступна в демо версії!

source: You have the reached the maximum amount of spaces that can be owned by you.
uk: Ви досягли максимального обсягу місця на дисках, яке може належати вам.

source: You have successfully created your own recipe space. Start by adding some recipes or invite other people to join you.
uk: Ви успішно створили власний простір для рецептів. Почніть з додавання рецептів або запросіть інших людей приєднатися до вас.

source: You do not have the required permissions to perform this action!
uk: Ви не маєте необхідних прав для виконання цієї дії!

source: Comment saved!
uk: Коментар збережено!

source: You must select at least one field to search!
uk: Ви мусите обрати хоча б одне поле для пошуку!

source: To use this search method you must select at least one full text search field!
uk: Щоб скористатися цим методом пошуку, ви повинні вибрати принаймні одне поле для повнотекстового пошуку!

source: Fuzzy search is not compatible with this search method!
uk: Нечіткий пошук не сумісний з цим методом пошуку!

source: PostgreSQL %(v)s is deprecated. Upgrade to a fully supported version!
uk: PostgreSQL %(v)s є застарілим. Оновіть до повністю підтримуваної версії!

source: You are running PostgreSQL %(v1)s. PostgreSQL %(v2)s is recommended
uk: Ви використовуєте PostgreSQL %(v1)s. Рекомендується використовувати PostgreSQL %(v2)s

source: Unable to determine PostgreSQL version.
uk: Не вдалося визначити версію PostgreSQL.

source: This application is not running with a Postgres database backend. This is ok but not recommended as some features only work with postgres databases.
uk: Ця програма не працює з базою даних Postgres. Це нормально, але не рекомендується, оскільки деякі функції працюють тільки з базами даних Postgres.

source: The setup page can only be used to create the first user! If you have forgotten your superuser credentials please consult the django documentation on how to reset passwords.
uk: Сторінка налаштувань може бути використана тільки для створення першого користувача! Якщо ви забули свої облікові дані суперкористувача, будь ласка, зверніться до документації Django, щоб дізнатися, як скинути пароль.

source: Passwords dont match!
uk: Паролі не збігаються!

source: User has been created, please login!
uk: Користувач створено, будь ласка, увійдіть!

source: Malformed Invite Link supplied!
uk: Надано неправильно сформоване посилання для запрошення!

source: Successfully joined space.
uk: Успішно долучились до простору.

source: Invite Link not valid or already used!
uk: Посилання для запрошення недійсне або вже використане!

source: Reporting share links is not enabled for this instance. Please notify the page administrator to report problems.
uk: Повідомлення про посилання для спільного доступу не ввімкнено для цього екземпляра. Будь ласка, повідомте адміністратора сторінки про проблеми.

source: Recipe sharing link has been disabled! For additional information please contact the page administrator.
uk: Посилання для обміну рецептами було вимкнено! Для отримання додаткової інформації зверніться до адміністратора сторінки.

source: Manage recipes, shopping list, meal plans and more.
uk: Керуйте рецептами, списком покупок, планами харчування тощо.

source: Plan
uk: План

source: View your meal Plan
uk: Перегляньте ваше меню

source: View your cookbooks
uk: Перегляньте ваші кулінарні книги

source: View your shopping lists
uk: Перегляньте ваші листи покупок
