Repository: TandoorRecipes/recipes
Catalog: cookbook/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Creating the best search experience is complicated and weighs heavily on your personal configuration. Changing any of the search settings can have significant impact on the speed and quality of the results. Search Methods, Trigrams and Full Text Search configurations are only available if you are using Postgres for your database.
uk: Створення найкращого досвіду пошуку є складним завданням і значною мірою залежить від ваших особистих налаштувань. Зміна будь-яких налаштувань пошуку може мати значний вплив на швидкість і якість результатів. Налаштування методів пошуку, триграм і повнотекстового пошуку доступні лише в тому випадку, якщо ви використовуєте Postgres для своєї бази даних.

source: Search Methods
uk: Методи пошуку

source: Full text searches attempt to normalize the words provided to match common variants. For example: 'forked', 'forking', 'forks' will all normalize to 'fork'. There are several methods available, described below, that will control how the search behavior should react when multiple words are searched. Full technical details on how these operate can be viewed on <a href=https://www.postgresql.org/docs/current/textsearch-controls.html#TEXTSEARCH-PARSING-QUERIES>Postgresql's website.</a>
uk: FПовний текстовий пошук намагається нормалізувати введені слова, щоб вони відповідали поширеним варіантам. Наприклад: «forked», «forking», «forks» будуть нормалізовані до «fork». Існує кілька методів, описаних нижче, які контролюють поведінку пошуку при пошуку декількох слів. Повні технічні деталі щодо їхнього функціонування можна переглянути на <a href=https://www.postgresql.org/docs/current/textsearch-controls.html#TEXTSEARCH-PARSING-QUERIES>Postgresql's website.</a>

source: Simple searches ignore punctuation and common words such as 'the', 'a', 'and'. And will treat separate words as required. Searching for 'apple or flour' will return any recipe that includes both 'apple' and 'flour' anywhere in the fields that have been selected for a full text search.
uk: Простий пошук ігнорує розділові знаки та загальні слова, такі як «та», «і», «з». І буде розглядати окремі слова як потрібно. Пошук за «яблуко or борошно» поверне будь-який рецепт, який містить як «яблуко», так і «борошно» в будь-якому місці полів, що були вибрані для повнотекстового пошуку.

source: Phrase searches ignore punctuation, but will search for all of the words in the exact order provided. Searching for 'apple or flour' will only return a recipe that includes the exact phrase 'apple or flour' in any of the fields that have been selected for a full text search.
uk: Пошук за фразою ігнорує розділові знаки, але шукає всі слова в точно заданому порядку. Пошук за запитом «яблуко or борошно» поверне тільки рецепти, які містять точну фразу «яблуко або борошно» в будь-якому з полів, вибраних для повнотекстового пошуку

source: Web searches simulate functionality found on many web search sites supporting special syntax. Placing quotes around several words will convert those words into a phrase. 'or' is recognized as searching for the word (or phrase) immediately before 'or' OR the word (or phrase) directly after. '-' is recognized as searching for recipes that do not include the word (or phrase) that comes immediately after. For example searching for 'apple pie' or cherry -butter will return any recipe that includes the phrase 'apple pie' or the word 'cherry' in any field included in the full text search but exclude any recipe that has the word 'butter' in any field included.
uk: Веб-пошук імітує функціональність багатьох веб-пошукових сайтів, що підтримують спеціальний синтакс пошуку. Якщо кілька слів взяти в лапки, вони перетворяться на фразу. 'or' розпізнається як пошук слова (або фрази), що стоїть безпосередньо перед “or”, АБО слова (або фрази), що стоїть безпосередньо після нього. Символ '-' розпізнається як пошук рецептів, які не містять слова (або фрази), що йде безпосередньо після нього. Наприклад, пошук «яблучний пиріг» or вишня -масло поверне будь-який рецепт, що містить фразу «яблучний пиріг» або слово «вишня» в будь-якому полі, включеному в повнотекстовий пошук, але виключить будь-який рецепт, що містить слово «масло» в будь-якому полі.

source: Raw search is similar to Web except will take puncuation operators such as '|', '&' and '()'
uk: Простий пошук схожий на веб-пошук, за винятком того, що він приймає оператори пунктуації, такі як '|', '&' and '()'

source: Another approach to searching that also requires Postgresql is fuzzy search or trigram similarity. A trigram is a group of three consecutive characters. For example searching for 'apple' will create x trigrams 'app', 'ppl', 'ple' and will create a score of how closely words match the generated trigrams. One benefit of searching trigams is that a search for 'sandwich' will find misspelled words such as 'sandwhich' that would be missed by other methods.
uk: Іншим підходом до пошуку, який також вимагає Postgresql, є нечіткий пошук або схожість триграм. Триграма - це група з трьох послідовних символів. Наприклад, пошук слова «яблуко» створить x триграм «ябл», «блу», «лук», «уко»і обчислить ступінь відповідності слів згенерованим триграм. Однією з переваг пошуку за триграмами є те, що пошук слова «піца» знайде слова з помилками, такі як «піцца», які не були б знайдені іншими методами.

source: Search Fields
uk: Поля пошуку

source: Unaccent is a special case in that it enables searching a field 'unaccented' for each search style attempting to ignore accented values. For example when you enable unaccent for 'Name' any search (starts with, contains, trigram) will attempt the search ignoring accented characters. For the other options, you can enable search on any or all fields and they will be combined together with an assumed 'OR'. For example enabling 'Name' for Starts With, 'Name' and 'Description' for Partial Match and 'Ingredients' and 'Keywords' for Full Search and searching for 'apple' will generate a search that will return recipes that have: - A recipe name that starts with 'apple' - OR a recipe name that contains 'apple' - OR a recipe description that contains 'apple' - OR a recipe that will have a full text search match ('apple' or 'apples') in ingredients - OR a recipe that will have a full text search match in Keywords Combining too many fields in too many types of search can have a negative impact on performance, create duplicate results or return unexpected results. For example, enabling fuzzy search or partial matches will interfere with web search methods. Searching for 'apple -pie' with fuzzy search and full text search will return the recipe Apple Pie. Though it is not included in the full text results, it does match the trigram results.
uk: Безакцентовий пошук є особливим випадком, оскільки дозволяє здійснювати пошук у полі «без акцентів» для кожного стилю пошуку, намагаючись ігнорувати значення з акцентами. Наприклад, коли ви вмикаєте безакцентовий пошук для поля «Назва», будь-який пошук ("починається з", "містить", "триграма") буде намагатися здійснити пошук, ігноруючи символи з акцентами. Для інших опцій ви можете ввімкнути пошук у будь-якому або всіх полях, і вони будуть об'єднані разом із припущенням 'OR'. Наприклад, увімкнувши поле «Назва» для пошуку «Починається з», «Назва» та «Опис» для пошуку «Часткове співпадіння» та «Інгредієнти» та «Ключові слова» для пошуку «Повний пошук» і шукаючи «яблуко», буде згенеровано пошук, який поверне рецепти, що мають: - Назва рецепта, що починається з «яблуко» - АБО назва рецепта, що містить «яблуко» - АБО опис рецепта, що містить «яблуко» - АБО рецепт, що має повний текстовий збіг («яблуко» або «яблука») в інгредієнтах - АБО рецепт, що має повний текстовий збіг у ключових словах Поєднання занадто багатьох полів у занадто багатьох типах пошуку може негативно вплинути на продуктивність, створити дублікати результатів або повернути несподівані результати. Наприклад, увімкнення нечіткого пошуку або часткових збігів заважатиме методам веб-пошуку. Пошук «яблучний -пиріг» з нечітким пошуком і повнотекстовим пошуком поверне рецепт «Яблучного Пиріг». Хоча він не включений у результати повнотекстового пошуку, він відповідає результатам триграми.

source: Search Index
uk: Пошуковий індекс

source: Trigram search and Full Text Search both rely on database indexes to perform effectively. You can rebuild the indexes on all fields in the Admin page for Recipes and selecting all recipes and running 'rebuild index for selected recipes' You can also rebuild indexes at the command line by executing the management command 'python manage.py rebuildindex'
uk: Ефективна робота триграмного пошуку та повнотекстового пошуку залежить від індексів бази даних. Ви можете перебудувати індекси для всіх полів на сторінці адміністрування рецептів, вибравши всі рецепти та запустивши функцію «Перебудувати індекс для вибраних рецептів» Ви також можете перебудувати індекси в командному рядку, виконавши команду управління «python manage.py rebuildindex»

source: There are many options to configure the search depending on your personal preferences.
uk: Існує багато варіантів налаштування пошуку залежно від ваших особистих уподобань.

source: Usually you do <b>not need</b> to configure any of them and can just stick with either the default or one of the following presets.
uk: Зазвичай вам <b>не потрібно</b> налаштовувати жодного з них і можна просто залишити стандартні налаштування або вибрати один із наступних пресетів.

source: If you do want to configure the search you can read about the different options <a href="/docs/search/">here</a>.
uk: Якщо ви дійсно хочете налаштувати пошук, ви можете прочитати про різні опції <a href="/docs/search/">тут</a>.

source: Fuzzy
uk: Нечіткий

source: Find what you need even if your search or the recipe contains typos. Might return more results than needed to make sure you find what you are looking for.
uk: Знайдіть те, що вам потрібно, навіть якщо у вашому пошуку або рецепті є помилки. Можливо, буде повернуто більше результатів, ніж потрібно, щоб ви точно знайшли те, що шукаєте.

source: This is the default behavior
uk: Це поведінка за замовчуванням

source: Apply
uk: Застосувати

source: Precise
uk: Точний

source: Allows fine control over search results but might not return results if too many spelling mistakes are made.
uk: Дозволяє точно контролювати результати пошуку, але може не повертати результати, якщо зроблено занадто багато орфографічних помилок.

source: Perfect for large Databases
uk: Ідеально для великих баз даних

source: Cookbook Setup
uk: Налаштування кулінарної книги

source: Setup
uk: Початкое налаштування

source: To start using this application you must first create a superuser account.
uk: Щоб почати користуватися цією програмою, спочатку потрібно створити обліковий запис суперкористувача.

source: Create Superuser account
uk: Створити акаунт Суперкористувача

source: Social Network Login Failure
uk: Помилка під час входу в соціальну мережу

source: An error occurred while attempting to login via your social network account.
uk: Під час спроби увійти через ваш обліковий запис у соціальній мережі сталася помилка.

source: Account Connections
uk: Підключення облікових записів

source: Social
uk: Соцмережи

source: You can sign in to your account using any of the following third party accounts:
uk: Ви можете увійти у свій обліковий запис, використовуючи будь-який із наступних облікових записів сторонніх сервісів:

source: You currently have no social network accounts connected to this account.
uk: У вас зараз не має акаунтів соцмереж прив'язаних до цього акаунту.

source: Add a 3rd Party Account
uk: Додати сторонній акаунт

source: Signup
uk: Реєстрація

source: Connect %(provider)s
uk: Підключити %(provider)s

source: You are about to connect a new third party account from %(provider)s.
uk: Ви збираєтеся підключити новий обліковий запис від %(provider)s.

source: Sign In Via %(provider)s
uk: Увійти через %(provider)s

source: You are about to sign in using a third party account from %(provider)s.
uk: Ви збираєтеся увійти за допомогою облікового запису від %(provider)s.

source: Continue
uk: Продовжити

source: You are about to use your %(provider_name)s account to login to %(site_name)s. As a final step, please complete the following form:
uk: Ви збираєтесь використати свій %(provider_name)s акаунт щоб увійти в %(site_name)s. В якості останнього кроку, будь ласка, заповніть наступну форму:

source: Sign in using
uk: Увійти, використовуючи

source: Space Management
uk: Управління простором

source: Space:
uk: Простір:

source: Manage Subscription
uk: Управління підписками

source: Space
uk: Простір

source: Recipes, foods, shopping lists and more are organized in spaces of one or more people.
uk: Рецепти, продукти харчування, списки покупок та інше організовані в просторах для однієї або декількох осіб.

source: You can either be invited into an existing space or create your own one.
uk: Ви можете бути запрошені в існуючий простір або створити свій власний.

source: Owner
uk: Власник

source: Leave Space
uk: Покинути простір

source: Join Space
uk: Доєднатися до простроу

source: Join an existing space.
uk: Доєднатися до існуючого простору.

source: To join an existing space either enter your invite token or click on the invite link the space owner send you.
uk: Щоб приєднатися до існуючого простору, введіть свій токен запрошення або натисніть на посилання запрошення, яке вам надіслав власник простору.

source: Create Space
uk: Створити простір

source: Create your own recipe space.
uk: Створіть власний простір для рецептів.

source: Start your own recipe space and invite other users to it.
uk: Створіть власний простір для рецептів і запросіть до нього інших користувачів.

source: Django Recipes is an open source free software application. It can be found on <a href="https://github.com/vabene1111/recipes">GitHub</a>. Changelogs can be found <a href="https://github.com/vabene1111/recipes/releases">here</a>.
uk: Django Recipes - це безкоштовна програма з відкритим кодом. Її можна знайти на <a href="https://github.com/vabene1111/recipes">GitHub</a>. Список змін знаходиться <a href="https://github.com/vabene1111/recipes/releases">тут</a>.

source: System Information
uk: Інформація про систему

source: You need to execute <code>version.py</code> in your update script to generate version information (done automatically in docker).
uk: Вам потрібно виконати<code>version.py</code> iу вашому скрипті оновлення, щоб згенерувати інформацію про версію (у Docker це робиться автоматично).

source: Media Serving
uk: Медіа-сервіс

source: Warning
uk: Застереження

source: Ok
uk: Ок

source: Serving media files directly using gunicorn/python is <b>not recommend</b>! Please follow the steps described <a href="https://github.com/vabene1111/recipes/releases/tag/0.8.1">here</a> to update your installation.
uk: Осблуговування медіа-файлів напряму з gunicorn/python <b>не рекомендується</b>! Будь ласка, виконайте кроки, описані <a href="https://github.com/vabene1111/recipes/releases/tag/0.8.1">тут</a> щоб оновити вашу інсталяцію.

source: Everything is fine!
uk: Все добре!

source: Secret Key
uk: Секретний ключ

source: You do not have a <code>SECRET_KEY</code> configured in your <code>.env</code> file. Django defaulted to the standard key provided with the installation which is publicly know and insecure! Please set <code>SECRET_KEY</code> int the <code>.env</code> configuration file.
uk: У вас не має <code>SECRET_KEY</code> налаштованого у вашому <code>.env</code> файлі. Django за замовчуванням використовує стандартний ключ що надається під час інсталяції та є широковідомим і небезпечним! Будь ласка налаштуйте <code>SECRET_KEY</code> у вашому <code>.env</code> конфігураційному файлі.

source: Debug Mode
uk: Режим налагодження

source: This application is still running in debug mode. This is most likely not needed. Turn of debug mode by setting <code>DEBUG=0</code> int the <code>.env</code> configuration file.
uk: Ця програма все ще працює в режимі налагодження. Швидше за все, це не потрібно. Вимкніть режим налагодження, встановившие <code>DEBUG=0</code> у <code>.env</code> конфігураційному файлі.

source: Allowed Hosts
uk: Дозволені хости

source: Your allowed hosts are configured to allow every host. This might be ok in some setups but should be avoided. Please see the docs about this.
uk: Ваші дозволені хости налаштовані так, щоб дозволяти всі хости. У деяких випадках це може бути прийнятним, але слід уникати такого налаштування. Дивіться документацію з цього приводу..

source: Database
uk: База даних

source: Info
uk: Інфо

source: Migrations
uk: Міграції

source: Migrations should never fail! Failed migrations will likely cause major parts of the app to not function correctly. If a migration fails make sure you are on the latest version and if so please post the migration log and the overview below in a GitHub issue.
uk: Міграції ніколи не повинні завершуватися з помилкою! Неуспішні міграції, ймовірно, призведуть до того, що основні частини програми не будуть працювати належним чином. Якщо міграція завершилася з помилкою, переконайтеся, що ви використовуєте останню версію, і, якщо це так, опублікуйте журнал міграції та огляд нижче в GitHub issue.

source: False
uk: Неправильно

source: True
uk: Правильно

source: Hide
uk: Приховати

source: Show
uk: Показати

source: URL Import
uk: Імпорт URL

source: Parameter updated_at incorrectly formatted
uk: Параметр updated_at має неправильний формат

source: No {self.basename} with id {pk} exists
uk: Не існує {self.basename} з id {pk}

source: Cannot merge with the same object!
uk: Неможливо об'єднати з тим самим об'єктом!

source: No {self.basename} with id {target} exists
uk: Ні існує {self.basename} з id {target}

source: Cannot merge with child object!
uk: Неможливо об'єднати з піделементм!

source: {source.name} was merged successfully with {target.name}
uk: {source.name} успішно обʼєднано з {target.name}

source: An error occurred attempting to merge {source.name} with {target.name}
uk: Сталася помилка під час спроби обʼєднати {source.name} з {target.name}

source: {child.name} was moved successfully to the root.
uk: {child.name} успішно переміщенно в корінь.

source: An error occurred attempting to move
uk: Помилка виникла під час спроби перемістити

source: Cannot move an object to itself!
uk: Не можна перемістити обʼєкт в самого себе!

source: No {self.basename} with id {parent} exists
uk: Не існує {self.basename} з {parent}

source: {child.name} was moved successfully to parent {parent.name}
uk: {child.name} було успішно переміщено до {parent.name}

source: {obj.name} was removed from the shopping list.
uk: {obj.name} було видалено з листа покупок.

source: {obj.name} was added to the shopping list.
uk: {obj.name} було додано до списку покупок.

source: Filter meal plans from date (inclusive) in the format of YYYY-MM-DD.
uk: Фільтруйте меню за датою (включно) у форматі РРРР-ММ-ДД.

source: Filter meal plans to date (inclusive) in the format of YYYY-MM-DD.
uk: Відфільтруйте меню до сьогоднішнього дня (включно) у форматі РРРР-ММ-ДД.

source: Filter meal plans with MealType ID. For multiple repeat parameter.
uk: Фільтруйте меню за Меню ID. Дозволено кілька повторів.

source: ID of recipe a step is part of. For multiple repeat parameter.
uk: ID рецепта, в якому знаходиться цей крок. Дозволено кілька повторів.

source: Query string matched (fuzzy) against object name.
uk: Рядок запиту збігається (нечітко) з назвою об'єкта.

source: Query string matched (fuzzy) against recipe name. In the future also fulltext search.
uk: Рядок запиту збігається (нечітко) з назвою рецепта. У майбутньому також буде доступний повнотекстовий пошук.

source: ID of keyword a recipe should have. For multiple repeat parameter. Equivalent to keywords_or
uk: ID ключового слова, яке повинно бути в рецепті. Дозволено кілька повторів. Еквівалентно keywords_or

source: Keyword IDs, repeat for multiple. Return recipes with any of the keywords
uk: ID ключових слів (дозволено кілька повторів). Повертає рецепти, які відповідають хоча б одному ключовому слову

source: Keyword IDs, repeat for multiple. Return recipes with all of the keywords.
uk: ID ключових слів (дозволено кілька повторів). Повертає рецепти, які відповідають всім ключовомим словам.

source: Keyword IDs, repeat for multiple. Exclude recipes with any of the keywords.
uk: ID ключових слів (дозволено кілька повторів). Виключає рецепти, які відповідають хоча б одному ключовому слову.

source: Keyword IDs, repeat for multiple. Exclude recipes with all of the keywords.
uk: ID ключових слів (дозволено кілька повторів). Виключає рецепти, які відповідають всім ключовомим словам.

source: ID of food a recipe should have. For multiple repeat parameter.
uk: Ідентифікатор продукту, який повинен бути в рецепті. Дозволено кілька повторів.

source: Food IDs, repeat for multiple. Return recipes with any of the foods
uk: ID продукту, дозволено кілька повторів. Повертає рецепти де є будь-який з продуктів

source: Food IDs, repeat for multiple. Return recipes with all of the foods.
uk: ID продукту, дозволено кілька повторів. Повертає рецепти де є всі продукти.

source: Food IDs, repeat for multiple. Exclude recipes with any of the foods.
uk: ID продукту, дозволено кілька повторів. Виключає рецепти де є будь-який з продуктів.

source: Food IDs, repeat for multiple. Exclude recipes with all of the foods.
uk: ID продукту, дозволено кілька повторів. Виключає рецепти де є всі продукти.

source: ID of unit a recipe should have.
uk: ID одиниці вимірювання яку мусить мати рецепт.

source: Rating a recipe should have or greater. [0 - 5] Negative value filters rating less than.
uk: Оцінка рецепту повинна бути не нижче. [0 - 5] Негативне значення фільтрує оцінки нижче.

source: ID of book a recipe should be in. For multiple repeat parameter.
uk: ID книги, в якій повинен бути рецепт. Дозволено кілька повторів.

source: Book IDs, repeat for multiple. Return recipes with any of the books
uk: ID книг, дозволено кілька повторів. Повертає рецепти з будь-якою з книг

source: Book IDs, repeat for multiple. Return recipes with all of the books.
uk: ID книг, дозволено кілька повторів. Повертає рецепти з усіма книгами.

source: Book IDs, repeat for multiple. Exclude recipes with any of the books.
uk: ID книг, дозволено кілька повторів. Виключає рецепти з будь-якою з книг.

source: Book IDs, repeat for multiple. Exclude recipes with all of the books.
uk: ID книг, дозволено кілька повторів. Виключає рецепти з усіма книгами.

source: If only internal recipes should be returned. [true/<b>false</b>]
uk: Якщо повинні повертатися тільки внутрішні рецепти. [true/<b>false</b>]

source: Returns the results in randomized order. [true/<b>false</b>]
uk: Повертає результати у випадковому порядку. [true/<b>false</b>]

source: Returns new results first in search results. [true/<b>false</b>]
uk: Повертає нові результати першими в результатах пошуку. [true/<b>false</b>]

source: Filter recipes cooked X times or more. Negative values returns cooked less than X times
uk: Відфільтрувати рецепти, приготовані X разів або більше. Від'ємні значення повертають рецепти, приготовані менше ніж X разів

source: Filter recipes last cooked on or after YYYY-MM-DD. Prepending - filters on or before date.
uk: Фільтрувати рецепти, приготовані в останній раз в день YYYY-MM-DD або пізніше. Додавання префікса - фільтрує за датою або раніше.

source: Filter recipes created on or after YYYY-MM-DD. Prepending - filters on or before date.
uk: Фільтрувати рецепти, створені в день YYYY-MM-DD або пізніше. Додавання префікса - фільтрує за датою або раніше.
