Repository: TandoorRecipes/recipes
Catalog: cookbook/locale/*/LC_MESSAGES/django.po
Languages: uk

source: Both fields are optional. If none are given the username will be displayed instead
uk: Обидва поля є необов'язковими. Якщо жодне з них не вказано, замість них буде відображено ім'я користувача

source: Name
uk: Назва

source: Keywords
uk: Ключові слова

source: Preparation time in minutes
uk: Час приготування у хвилинах

source: Waiting time (cooking/baking) in minutes
uk: Час очікування (варіння/випічка) у хвилинах

source: Path
uk: Шлях

source: Storage UID
uk: UID сховища

source: Default
uk: За замовчуванням

source: To prevent duplicates recipes with the same name as existing ones are ignored. Check this box to import everything.
uk: Щоб запобігти дублюванням, рецепти з назвами, що вже існують, ігноруватимуться. Установіть цей прапорець, щоб імпортувати все.

source: Add your comment:
uk: Додайте ваш коментар:

source: Leave empty for dropbox and enter app password for nextcloud.
uk: Залиште порожнім для dropbox і введіть api ключі для nextcloud.

source: Leave empty for nextcloud and enter api token for dropbox.
uk: Залиште порожнім для nextcloud і введіть api ключі для dropbox.

source: Leave empty for dropbox and enter only base url for nextcloud (<code>/remote.php/webdav/</code> is added automatically)
uk: Залиште порожнім для dropbox і введіть лише базовий url для nextcloud (<code>/remote.php/webdav/</code> буде додано автоматично)

source: <a href="https://www.home-assistant.io/docs/authentication/#your-account-profile">Long Lived Access Token</a> for your HomeAssistant instance
uk: <a href="https://www.home-assistant.io/docs/authentication/#your-account-profile">Довговічний токен доступу</a> для вашої інстанції HomeAssistant

source: Something like http://homeassistant.local:8123/api
uk: Щось на кшталт http://homeassistant.local:8123/api

source: http://homeassistant.local:8123/api for example
uk: http://homeassistant.local:8123/api наприклад

source: Storage
uk: Сховище

source: Active
uk: Активний

source: Search String
uk: Рядок пошуку

source: File ID
uk: ID файлу

source: Maximum number of users for this space reached.
uk: Досягнута максимальна кількість користувачів для цього простору.

source: Email address already taken!
uk: Ця адреса електронної пошти вже зайнята!

source: An email address is not required but if present the invite link will be sent to the user.
uk: Адреса електронної пошти не обов'язкова, але якщо вона вказана, користувачеві буде надіслано посилання для запрошення.

source: Name already taken.
uk: Ім'я вже зайняте.

source: Accept Terms and Privacy
uk: Прийняти умови використування та конфіденційності

source: Determines how fuzzy a search is if it uses trigram similarity matching (e.g. low values mean more typos are ignored).
uk: Визначає, наскільки нечітким є пошук, якщо він використовує зіставлення за схожістю триграм (наприклад, низькі значення означають, що більше друкарських помилок ігнорується).

source: Select type method of search. Click <a href="/docs/search/">here</a> for full description of choices.
uk: Виберіть метод пошуку. Натисніть <a href="/docs/search/">тут</a> для повного опису опцій.

source: Use fuzzy matching on units, keywords and ingredients when editing and importing recipes.
uk: Використовуйте нечітке зіставлення одиниць вимірювання, ключових слів та інгредієнтів під час редагування та імпорту рецептів.

source: Fields to search ignoring accents. Selecting this option can improve or degrade search quality depending on language
uk: Поля для пошуку без урахування діакритичних знаків. Вибір цієї опції може покращити або погіршити якість пошуку залежно від мови

source: Fields to search for partial matches. (e.g. searching for 'Pie' will return 'pie' and 'piece' and 'soapie')
uk: Поля для пошуку часткових збігів. (наприклад, пошук за запитом «Pie» поверне «pie», «piece» та «soapie»)

source: Fields to search for beginning of word matches. (e.g. searching for 'sa' will return 'salad' and 'sandwich')
uk: Поля для пошуку збігів на початку слів. (наприклад, пошук за запитом «sa» поверне «salad» та «sandwich»)

source: Fields to 'fuzzy' search. (e.g. searching for 'recpie' will find 'recipe'.) Note: this option will conflict with 'web' and 'raw' methods of search.
uk: Поля для «нечіткого» пошуку. (наприклад, пошук за запитом «recpie» знайде «recipe»). Примітка: цей параметр конфліктуватиме з методами пошуку «web» та «raw».

source: Fields to full text search. Note: 'web', 'phrase', and 'raw' search methods only function with fulltext fields.
uk: Поля для повнотекстового пошуку. Примітка: методи пошуку «web», «phrase» та «raw» працюють лише з повнотекстовими полями.

source: Search Method
uk: Метод Пошуку

source: Fuzzy Lookups
uk: Нечіткі пошуки

source: Ignore Accent
uk: Ігнорувати акцент

source: Partial Match
uk: Частковий збіг

source: Starts With
uk: Починається З

source: Fuzzy Search
uk: Нечіткий пошук

source: Full Text
uk: Повний текст

source: In order to prevent spam, the requested email was not send. Please wait a few minutes and try again.
uk: Щоб запобігти спаму, запитуваний електронний лист не було надіслано. Будь ласка, зачекайте кілька хвилин і спробуйте ще раз.

source: You are not logged in and therefore cannot view this page!
uk: Ви не ввійшли в систему, тому не можете переглянути цю сторінку!

source: You do not have the required permissions to view this page!
uk: У вас немає необхідних дозволів для перегляду цієї сторінки!

source: You cannot interact with this object as it is not owned by you!
uk: Ви не можете взаємодіяти з цим об'єктом, оскільки він вам не належить!

source: You have reached the maximum number of recipes for your space.
uk: Ви досягли максимальної кількості рецептів для вашого простору.

source: You have more users than allowed in your space.
uk: У вашому просторі більше користувачів, ніж дозволено.

source: reverse rotation
uk: зворотне обертання

source: careful rotation
uk: обережне обертання

source: knead
uk: замісити

source: thicken
uk: згустити

source: warm up
uk: розігріти

source: ferment
uk: ферментувати

source: sous-vide
uk: су-від

source: You must supply a servings size
uk: Ви повинні вказати розмір порції

source: Could not parse template code.
uk: Не вдалося проаналізувати код шаблону.

source: Favorite
uk: Улюблене

source: I made this
uk: Я зробив це

source: Importer expected a .zip file. Did you choose the correct importer type for your data ?
uk: Імпортер очікував ZIP-файл. Чи ви обрали правильний тип імпортера для своїх даних?

source: An unexpected error occurred during the import. Please make sure you have uploaded a valid file.
uk: Під час імпорту сталася несподівана помилка. Переконайтеся, що ви завантажили дійсний файл.

source: The following recipes were ignored because they already existed:
uk: Наступні рецепти були проігноровані, оскільки вони вже існували:

source: Imported %s recipes.
uk: Імпортовано %s рецептів.

source: Recipe source:
uk: Джерело рецепту:

source: Notes
uk: Нотатки

source: Nutritional Information
uk: Інформація про поживність

source: Source
uk: Джерело

source: Imported from
uk: Імпортовано з

source: Servings
uk: Порції

source: Waiting time
uk: Час очікування

source: Preparation Time
uk: Час підготовки

source: Cookbook
uk: Кулінарна книга

source: Section
uk: Розділ

source: Fixes foods with
uk: Виправити продукт з

source: Rebuilds full text search index on Recipe
uk: Перебудовує індекс повнотекстового пошуку по рецептам

source: Only Postgresql databases use full text search, no index to rebuild
uk: Тільки бази даних Postgresql використовують повнотекстовий пошук, без індексу для перебудови

source: Recipe index rebuild complete.
uk: Перебудова індексу рецептів завершена.

source: Recipe index rebuild failed.
uk: Не вдалося перебудувати індекс рецептів.

source: Breakfast
uk: Сніданок

source: Lunch
uk: Обід

source: Dinner
uk: Вечеря

source: Other
uk: Інше

source: Fat
uk: Жир

source: g
uk: г

source: Carbohydrates
uk: Вуглеводи

source: Proteins
uk: Білки

source: Calories
uk: Калорії

source: kcal
uk: ккал

source: Maximum file storage for space in MB. 0 for unlimited, -1 to disable file upload.
uk: Максимальний обсяг файлів для зберігання в МБ. 0 для необмеженого обсягу, -1 для відключення завантаження файлів.

source: Search
uk: Пошук

source: Meal-Plan
uk: План харчування

source: Books
uk: Книги

source: Shopping
uk: Покупки

source: is part of a recipe step and cannot be deleted
uk: є частиною кроку рецепта та не може бути видалений

source: Nutrition
uk: Поживність

source: Allergen
uk: Алерген

source: Price
uk: Ціна

source: Goal
uk: Мета

source: Simple
uk: Простий

source: Phrase
uk: Фраза

source: Web
uk: Веб

source: Raw
uk: Сирий

source: Food Alias
uk: Псевдонім продукту

source: Unit Alias
uk: Псевдонім одиниці вимірювання

source: Keyword Alias
uk: Псевдонім ключового слова

source: Description Replace
uk: Замінити опис

source: Instruction Replace
uk: Замінити інструкції

source: Never Unit
uk: Без одиниц вимірнювання

source: Transpose Words
uk: Переставити слова

source: Food Replace
uk: Заміна їжі

source: Unit Replace
uk: Заміна одиниці вимірювання

source: Name Replace
uk: Заміна назви

source: Recipe
uk: Рецепт

source: Food
uk: Їжа

source: Keyword
uk: Ключове слово

source: File uploads are not enabled for this Space.
uk: Завантаження файлів не дозволено в цьому просторі.

source: You have reached your file upload limit.
uk: Ви досягли ліміту завантаження файлів.

source: Cannot modify Space owner permission.
uk: Неможливо змінити права власника простору.

source: Hello
uk: Вітаю

source: You have been invited by
uk: Вас було запрошено

source: to join their Tandoor Recipes space
uk: долучитись до їхнього Tandoor Рецепти простору

source: Click the following link to activate your account:
uk: Натісніть на посилання щоб активувати ваш акаунт:

source: If the link does not work use the following code to manually join the space:
uk: Якщо посилання не працює, використовуйте код, щоб самостійно доєднатись до простору:

source: The invitation is valid until
uk: Запрощення дійсне до

source: Tandoor Recipes is an Open Source recipe manager. Check it out on GitHub
uk: Tandoor Рецепти — це менеджер рецептів з відкритим кодом. Перегляньте його на GitHub.

source: Tandoor Recipes Invite
uk: Tandoor Рецепти запрошення

source: Existing shopping list to update
uk: Існуючий список покупок для оновлення

source: List of ingredient IDs from the recipe to add, if not provided all ingredients will be added.
uk: Список ID інгредієнтів з рецепту, які потрібно додати. Якщо не обрані, будуть додані всі інгредієнти.

source: Providing a list_recipe ID and servings of 0 will delete that shopping list.
uk: Вказавши list_recipe ID та кількість порцій 0, ви видалите цей список покупок.

source: Amount of food to add to the shopping list
uk: Кількість продуктів, які потрібно додати до списку покупок

source: ID of unit to use for the shopping list
uk: ID одиниці вимірювання, що використовується для списку покупок

source: When set to true will delete all food from active shopping lists.
uk: Якщо встановлено значення true, всі продукти будуть видалені з активних списків покупок.

source: Delete
uk: Видалити

source: 404 Error
uk: Помилка 404

source: The page you are looking for could not be found.
uk: Сторінка, яку ви шукаєте, не знайдена.

source: Take me Home
uk: На головну

source: Report a Bug
uk: Повідомити про помилку

source: E-mail Addresses
uk: Адреси e-mail

source: Settings
uk: Налаштування

source: The following e-mail addresses are associated with your account:
uk: Наступні адреси email пов'язані з вашим обліковим записом:

source: Verified
uk: Перевірено

source: Unverified
uk: Неперевірено

source: Primary
uk: Головний

source: Make Primary
uk: Зробити головним

source: Re-send Verification
uk: Повторно надіслати підтвердження

source: Remove
uk: Прибрати

source: Warning:
uk: Попередження:

source: You currently do not have any e-mail address set up. You should really add an e-mail address so you can receive notifications, reset your password, etc.
uk: Наразі у вас не налаштовано жодної адреси електронної пошти. Вам слід додати адресу електронної пошти, щоб отримувати сповіщення, скидати пароль тощо.

source: Add E-mail Address
uk: Додати адресу електронної пошти

source: Add E-mail
uk: Додати електрону пошту

source: Do you really want to remove the selected e-mail address?
uk: Ви дійсно хочете видалити вибрану адресу електронної пошти?

source: Confirm E-mail Address
uk: Підтвердити адресу електронної пошти

source: Please confirm that <a href="mailto:%(email)s">%(email)s</a> is an e-mail address for user %(user_display)s .
uk: Будь ласка, підтвердьте <a href="mailto:%(email)s">%(email)s</a> e-mail для користувача %(user_display)s .

source: Confirm
uk: Підтвердьте

source: This e-mail confirmation link expired or is invalid. Please <a href="%(email_url)s">issue a new e-mail confirmation request</a>.
uk: Це посилання для підтвердження електронної пошти прострочено або недійсне. Будь ласка, <a href="%(email_url)s">надішліть новий запит на підтвердження електронної пошти</a>.

source: Login
uk: Вхід

source: Sign In
uk: Увійти

source: Sign Up
uk: Зареєструватись

source: Lost your password?
uk: Загубили пароль?

source: Reset My Password
uk: Скинути мій пароль

source: Social Login
uk: Вхід через соцмережи

source: You can use any of the following providers to sign in.
uk: Ви можете використовувати будь-що з наступного для входу.

source: Sign Out
uk: Вихід

source: Are you sure you want to sign out?
uk: Ви впевнені, що хочете вийти?

source: Change Password
uk: Змінити пароль

source: Password
uk: Пароль

source: Forgot Password?
uk: Забули пароль?

source: Password Reset
uk: Скинути пароль

source: Forgotten your password? Enter your e-mail address below, and we'll send you an e-mail allowing you to reset it.
uk: Забули пароль? Введіть свою адресу електронної пошти нижче, і ми надішлемо вам електронного листа, який дозволить вам його змінити.

source: Password reset is disabled on this instance.
uk: Скидання пароля на цьому сервері відключено.

source: We have sent you an e-mail. Please contact us if you do not receive it within a few minutes.
uk: Ми надіслали вам електронного листа. Якщо ви не отримаєте його протягом декількох хвилин, зв'яжіться з нами.

source: Bad Token
uk: Некоректний токен

source: The password reset link was invalid, possibly because it has already been used. Please request a <a href="%(passwd_reset_url)s">new password reset</a>.
uk: Посилання для скидання пароля було недійсним, можливо, тому що воно вже було використано. Будь ласка, запросіть <a href="%(passwd_reset_url)s">нове посилання для скидання пароля</a>.

source: change password
uk: змінити пароль

source: Your password is now changed.
uk: Ваш пароль тепер змінено.

source: Set Password
uk: Встановити пароль

source: Register
uk: Зареєструватись

source: Create an Account
uk: Створити акаунт

source: I accept the follwoing
uk: Я приймаю наступне

source: Terms and Conditions
uk: Умови та положення

source: and
uk: і

source: Privacy Policy
uk: Політика конфіденційності

source: Create User
uk: Створити користувача

source: Already have an account?
uk: Вже є акаунт?

source: Sign Up Closed
uk: Реєстрація закрита

source: We are sorry, but the sign up is currently closed.
uk: На жаль, реєстрація наразі закрита.

source: API Documentation
uk: API документація

source: Recipes
uk: Рецепти

source: Foods
uk: Продукти харчування

source: Units
uk: Одиниці вимірювання

source: Supermarket
uk: Супермаркет

source: Supermarket Category
uk: Категорія супермаркетів

source: Automations
uk: Автоматизації

source: Files
uk: Файли

source: Batch Edit
uk: Групове редагування

source: History
uk: Історія

source: Ingredient Editor
uk: Редактор Інгредієнтів

source: Export
uk: Експорт

source: Properties
uk: Властивості

source: Unit Conversions
uk: Конвертація одиниць вимірювання

source: Import Recipe
uk: Імпортувати рецепт

source: Create
uk: Створити

source: External Recipes
uk: Зовнішні рецепти

source: Space Settings
uk: Налаштування простору

source: External Connectors
uk: Зовнішні підключення

source: System
uk: Система

source: Admin
uk: Адмін

source: Your Spaces
uk: Ваші простори

source: Overview
uk: Огляд

source: Markdown Guide
uk: Посібник з Markdown

source: Translate Tandoor
uk: Переклад Tandoor

source: API Browser
uk: Браузер API

source: Log out
uk: Вийти

source: You are using the free version of Tandor
uk: Ви використовуєте безкоштовну версію Tandor

source: Upgrade Now
uk: Оновити Зараз

source: Batch edit Category
uk: Групове редагування Категорії

source: Batch edit Recipes
uk: Групове редагування Рецептів

source: Add the specified keywords to all recipes containing a word
uk: Додати вказані ключові слова до всіх рецептів, що містять слово

source: Sync
uk: Синхронізація

source: Manage watched Folders
uk: Керувати папками, що відстежуються

source: On this Page you can manage all storage folder locations that should be monitored and synced.
uk: На цій сторінці ви можете керувати всіма папками для зберігання, які слід контролювати та синхронізувати.

source: The path must be in the following format
uk: Шлях повинен мати такий формат

source: Save
uk: Зберігти

source: Manage External Storage
uk: Керувати зовнішнім сховищем

source: Sync Now!
uk: Синхронізувати зараз!

source: Show Recipes
uk: Показати рецепти

source: Show Log
uk: Показати лог

source: Importing Recipes
uk: Імпорт рецептів

source: This can take a few minutes, depending on the number of recipes in sync, please wait.
uk: Це може зайняти кілька хвилин, залежно від кількості синхронізованих рецептів. Будь ласка, зачекайте.

source: Recipe Books
uk: Книги рецептів

source: Export Recipes
uk: Експорт рецептів

source: Import new Recipe
uk: Імпортувати новий рецепт

source: Edit Recipe
uk: Редагувати рецепт

source: Are you sure you want to delete the %(title)s: <b>%(object)s</b>
uk: Ви впевнені, що хочете видалити %(title)s: <b>%(object)s</b>?

source: This cannot be undone!
uk: Це не можна скасувати!

source: Protected
uk: Захищено

source: Cascade
uk: Каскад

source: Cancel
uk: Відміна

source: Edit
uk: Редагувати

source: View
uk: Перегляд

source: Delete original file
uk: Видалити оригінальний файл

source: List
uk: Список

source: Filter
uk: Фільтр

source: Import all
uk: Імпортувати все

source: New
uk: Новий

source: previous
uk: попередній

source: next
uk: наступний

source: View Log
uk: Подивитись лог

source: Cook Log
uk: Лог готування

source: Import
uk: Імпорт

source: Security Warning
uk: Попередження про безпеку

source: The <b>Password and Token</b> field are stored as <b>plain text</b> inside the database. This is necessary because they are needed to make API requests, but it also increases the risk of someone stealing it. <br/> To limit the possible damage tokens or accounts with limited access can be used.
uk: Поля <b>пароль і токен</b> зберігаються як <b>простий текст</b> в базі даних. Це необхідно, оскільки вони потрібні для здійснення запитів API, але це також збільшує ризик їхнього викрадення <br/> Щоб обмежити можливий збиток, можна використовувати токени або облікові записи з обмеженим доступом.

source: Search recipe ...
uk: Пошук рецепту...

source: New Recipe
uk: Новий рецепт

source: Advanced Search
uk: Розширений пошук

source: Reset Search
uk: Скинути пошук

source: Last viewed
uk: Останній переглянутий

source: Log in to view recipes
uk: Ввійти щоб подивитись рецепти

source: Markdown Info
uk: Інформація про Markdown

source: Markdown is lightweight markup language that can be used to format plain text easily. This site uses the <a href="https://python-markdown.github.io/" target="_blank">Python Markdown</a> library to convert your text into nice looking HTML. Its full markdown documentation can be found <a href="https://daringfireball.net/projects/markdown/syntax" target="_blank">here</a>. An incomplete but most likely sufficient documentation can be found below.
uk: Markdown - проста мова розмітки, яку можна використовувати для простого форматування звичайного тексту. Цей сайт використовує бібліотеку <a href="https://python-markdown.github.io/" target="_blank">Python Markdown</a> для перетворення вашого тексту в приємний на вигляд HTML. Повну документацію щодо Markdown можна знайти <a href="https://daringfireball.net/projects/markdown/syntax" target="_blank">here</a>. Неповну, але, найімовірніше, достатню документацію можна знайти нижче.

source: Headers
uk: Заголовки

source: Formatting
uk: Форматування

source: Line breaks are inserted by adding two spaces after the end of a line
uk: Розриви рядків вставляються шляхом додавання двох пробілів після кінця рядка

source: or by leaving a blank line in between.
uk: або залишивши порожній рядок між ними.

source: This text is bold
uk: Цей текст виділено жирним шрифтом

source: This text is italic
uk: Цей текст виділено курсивом

source: Blockquotes are also possible
uk: Також можливі цитати

source: Lists
uk: Списки

source: Lists can ordered or unordered. It is <b>important to leave a blank line before the list!</b>
uk: Списки можуть бути впорядкованими або невпорядкованими. <b>Важливо залишати порожній рядок перед списком!</b>

source: Ordered List
uk: Упорядкований список

source: unordered list item
uk: елемент неупорядкованого списку

source: Unordered List
uk: Неупорядкований список

source: ordered list item
uk: елемент упорядкованого списку

source: Images & Links
uk: Зображення та посилання

source: Links can be formatted with Markdown. This application also allows to paste links directly into markdown fields without any formatting.
uk: Посилання можна форматувати за допомогою Markdown. Ця програма також дозволяє вставляти посилання безпосередньо в поля Markdown без будь-якого форматування.

source: This will become an image
uk: Це стане зображенням

source: Tables
uk: Таблиці

source: Markdown tables are hard to create by hand. It is recommended to use a table editor like <a href="https://www.tablesgenerator.com/markdown_tables" rel="noreferrer noopener" target="_blank">this one.</a>
uk: Таблиці Markdown важко створювати вручну. Рекомендується використовувати редактор таблиць, такий як<a href="https://www.tablesgenerator.com/markdown_tables" rel="noreferrer noopener" target="_blank">ось цей.</a>

source: Table
uk: Таблиця

source: Header
uk: Шапка

source: Cell
uk: Клітинка

source: No Permissions
uk: Не має дозволів

source: You do not have any groups and therefor cannot use this application.
uk: У вас немає груп, тому ви не можете користуватися цією програмою.

source: Please contact your administrator.
uk: Зверніться до вашого адміністратора.

source: No Permission
uk: Нема доступів

source: You do not have the required permissions to view this page or perform this action.
uk: Ви не маєте необхідних прав для перегляду цієї сторінки або виконання цієї дії.

source: Offline
uk: Оффлайн

source: You are currently offline!
uk: Ви наразі оффлайн!

source: The recipes listed below are available for offline viewing because you have recently viewed them. Keep in mind that data might be outdated.
uk: Наведені нижче рецепти доступні для перегляду в автономному режимі, оскільки ви нещодавно їх переглядали. Майте на увазі, що дані можуть бути застарілими.

source: Back
uk: Назад

source: Property Editor
uk: Редактор властивостей

source: Comments
uk: Коментарі

source: Comment
uk: Коментар

source: Recipe Home
uk: Головна рецептів

source: Search Settings
uk: Налаштування пошуку
